fonecmid-diplom/src/Documents/ВКМ_НачисленияЗарплаты/ВКМ_НачисленияЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачисленияЗарплаты</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>EnumRef.ВКМ_КатегорииСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>DefinedType.ВКМ_Валюта</types>
    </type>
  </resources>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ВКМ_ГрафикРаботы</schedule>
  <scheduleValue>InformationRegister.ВКМ_ГрафикРаботы.Resource.РабочихДней</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_ГрафикРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>DefinedType.ВКМ_Валюта</types>
    </type>
  </resources>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>DefinedType.ВКМ_Валюта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ВКМ_Валюта</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/Enums/ВКМ_КатегорииСотрудников/ВКМ_КатегорииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_КатегорииСотрудников</name>
  <enumValues>
    <name>Специалист</name>
  </enumValues>
  <enumValues>
    <name>АдминистративныйПерсонал</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>ПремияПроцентом</name>
      <description>Премия процентом</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Отпуск</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

fonecmid-diplom/src/Documents/ВКМ_НачисленияЗарплаты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Начисления.Количество() <> 0 Тогда
	
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Категория,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад,
		|	ВКМ_НачисленияЗарплатыНачисления.Сотрудник,
		|	ВКМ_НачисленияЗарплатыНачисления.ВидРасчета,
		|	ВКМ_НачисленияЗарплатыНачисления.ДатаНачала,
		|	ВКМ_НачисленияЗарплатыНачисления.ДатаОкончания,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот,
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход
		|ИЗ
		|	Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ВКМ_НачисленияЗарплатыНачисления
		|		ПРАВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период,) КАК
		|			ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВКМ_НачисленияЗарплатыНачисления.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
		|		ПРАВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода,
		|			Месяц,) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
		|		ПО ВКМ_НачисленияЗарплатыНачисления.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник
		|ГДЕ
		|	ВКМ_НачисленияЗарплатыНачисления.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Период", Дата);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
		Запрос.УстановитьПараметр("Ссылка", Ссылка);	
		
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();	
		
		Для каждого Строка из РезультатЗапроса Цикл
		
				Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
				
					Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
					Движение.Сторно = Ложь;
					Движение.ВидРасчета = Строка.ВидРасчета;
					Движение.ПериодДействияНачало = Строка.ДатаНачала;
					Движение.ПериодДействияКонец = Строка.ДатаОкончания;
					Движение.ПериодРегистрации = Дата;		
					Движение.Сотрудник = Строка.Сотрудник;
					Движение.Показатель = Строка.Оклад;
					
					Движение = Движения.ВКМ_Удержания.Добавить();
					Движение.Сторно = Ложь;
					Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
					Движение.ПериодДействияНачало = Строка.ДатаНачала;
					Движение.ПериодДействияКонец = Строка.ДатаОкончания;
					Движение.ПериодРегистрации = Дата;
					Движение.Сотрудник = Строка.Сотрудник;
					
					Если Строка.Категория = Перечисления.ВКМ_КатегорииСотрудников.Специалист Тогда
					
						Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
						Движение.Сторно = Ложь;
						Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПремияПроцентом;
						Движение.ПериодДействияНачало = Строка.ДатаНачала;
						Движение.ПериодДействияКонец = Строка.ДатаОкончания;
						Движение.ПериодРегистрации = Дата;		
						Движение.Сотрудник = Строка.Сотрудник;	
						Движение.Показатель = Строка.ПроцентОтРабот;
						Движение.Сумма = Строка.СуммаКОплатеПриход;
								
						Движение = Движения.ВКМ_Удержания.Добавить();
						Движение.Сторно = Ложь;
						Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
						Движение.ПериодДействияНачало = Строка.ДатаНачала;
						Движение.ПериодДействияКонец = Строка.ДатаОкончания;
						Движение.ПериодРегистрации = Дата;
						Движение.Сотрудник = Строка.Сотрудник;
						Движение.Сумма = Строка.СуммаКОплатеПриход * 0.13;
					
					КонецЕсли;
					
				ИначеЕсли Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
					
					Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
					Движение.Сторно = Ложь;
					Движение.ВидРасчета = Строка.ВидРасчета;
					Движение.ПериодДействияНачало = Строка.ДатаНачала;
					Движение.ПериодДействияКонец = Строка.ДатаОкончания;
					Движение.ПериодРегистрации = Дата;		
					Движение.Сотрудник = Строка.Сотрудник;
					Движение.Показатель = 0;
					
					Движение = Движения.ВКМ_Удержания.Добавить();
					Движение.Сторно = Ложь;
					Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
					Движение.ПериодДействияНачало = Строка.ДатаНачала;
					Движение.ПериодДействияКонец = Строка.ДатаОкончания;
					Движение.ПериодРегистрации = Дата;
					Движение.Сотрудник = Строка.Сотрудник;
					
				Иначе
					Продолжить;
					
				КонецЕсли;
				
		КонецЦикла;
	
		Движения.ВКМ_ОсновныеНачисления.Записать();
		Движения.ВКМ_Удержания.Записать();
		
		Для Каждого Движение Из Движения.ВКМ_ОсновныеНачисления Цикл
			
			Если Движение.Вид = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			
				План = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ПериодДействия);
				Факт = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ФактическийПериодДействия);
				
				Результат = Движение.Показатель/План[0].РабочихДней*Факт[0].РабочихДней;
				
				Движение.Сумма = Результат;
			
			ИначеЕсли Движение.Вид = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПремияПроцентом Тогда
				
				Продолжить;
					
			ИначеЕсли Движение.Вид = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда				
				
				БазовыйПериодНачало = Дата - 86400*365;
				БазовыйПериодКонец = Дата;
				
				Запрос = Новый Запрос;
				
				Запрос.Текст = "ВЫБРАТЬ
				|	ВКМ_ОсновныеНачисленияДанныеГрафика.РабочихДнейБазовыйПериод,
				|	ВКМ_ОсновныеНачисленияДанныеГрафика.РабочихДнейФактическийПериодДействия,
				|	ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.Результат,
				|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход
				|ИЗ
				|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика() КАК ВКМ_ОсновныеНачисленияДанныеГрафика
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления КАК
				|			ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
				|		ПО ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&БазовыйПериодНачало,
				|			&БазовыйПериодКонец,,) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
				|		ПО ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.Сотрудник = ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник
				|ГДЕ
				|	ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.БазовыйПериодНачало = &БазовыйПериодНачало
				|	И ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.БазовыйПериодКонец = &БазовыйПериодКонец
				|	И ВКМ_ОсновныеНачисленияДанныеГрафика.БазовыйПериодКонец = &БазовыйПериодКонец
				|	И ВКМ_ОсновныеНачисленияДанныеГрафика.БазовыйПериодНачало = &БазовыйПериодНачало
				|	И ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.Сотрудник = &Сотрудник";
			КонецЕсли;
			
			Запрос.УстановитьПараметр("БазовыйПериодНачало", БазовыйПериодНачало);						
			Запрос.УстановитьПараметр("БазовыйПериодКонец", БазовыйПериодКонец);	
			Запрос.УстановитьПараметр("Сотрудник", Движение.Сотрудник);	
			
			РезультатЗапроса = Запрос.Выполнить.Выгрузить();
			СтоимостьДняОтпуска = (РезультатЗапроса.Результат + РезультатЗапроса.СуммаКОплатеПриход)/РезультатЗапроса.РабочихДнейФактическийПериодДействия;
			Движение.Сумма = (БазовыйПериодКонец - БазовыйПериодНачало + 86400) / 86400;
					
		КонецЦикла;
		
		Движения.ВКМ_ОсновныеНачисления.Записать();
				
		Для Каждого Движение Из Движения.ВКМ_Удержания Цикл
		
			
			
		КонецЦикла;
		
		Движения.ВКМ_Удержания.Записать();
					
	Иначе
			
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Табличная часть документа не может быть пустой";
		Сообщение.Сообщить();			
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
